quarkus-app/src/main/taurus/script_test_taurus.yaml
execution:
- concurrency: 5
  ramp-up: 20s
  hold-for: 2m
  scenario: Simple
 

#scenarios:
#  Simple :
#    default-address: "https://www.wordreference.com"
#    requests: 
#      - label: "/definicion/ocurre"
#        url: "/definicion/ocurre"
#        method: GET

scenarios:
  Simple :
    default-address: "http://${HOST_DOCKER_IP}:8080"
    requests: 
      - label: "/hello"
        url: "/hello"
        method: GET